Subroutine/SY_3dHeatLoad/Automated/Sim_InnerField/Jet_inner_case_template/0/T_orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 330;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    wall
    {
        type            fixedValue;
        value           nonuniform List<scalar>
36979
(
);
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
