Subroutine/SY_3dHeatLoad/Automated/Sim_InnerField/Jet_inner_case_template/system/streamlines
// -*- C++ -*-

nLines  24;
start   (0 0.5 0);
end     (9 0.5 0);
fields  (p);

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"


// ************************************************************************* //
